# Chinese (Mainland) Economic Data - Financial Data - Interest Rate Data

In [3]:
import dai
import pandas as pd
pd.set_option('display.max_row', 6)
pd.set_option('display.max_column', None)

## 1. Policy Rates

In [4]:
dai.query("""
SELECT *
FROM loan_prime_rate
WHERE date >= '2015-12-31'
""").df()

         date   year1   year5
0  2019-08-20  0.0425  0.0485
1  2019-09-20  0.0420  0.0485
2  2019-10-21  0.0420  0.0485
..        ...     ...     ...
75 2025-11-20  0.0300  0.0350
76 2025-12-22  0.0300  0.0350
77 2026-01-20  0.0300  0.0350

[78 rows x 3 columns]

## 2. Inter-Bank Rates

### 2.1 SHIBOR Quote Data

In [5]:
dai.query("""
SELECT *
FROM cn_shibor_quote_TS_raw
WHERE date >= '2015-12-31'
""").df()

,date,bank,on_b,on_a,in_1w_b,in_1w_a,in_2w_b,in_2w_a,in_1m_b,in_1m_a,in_3m_b,in_3m_a,in_6m_b,in_6m_a,in_9m_b,in_9m_a,in_1y_b,in_1y_a
0,2022-01-04,华夏银行,1.94,1.94,2.10,2.10,2.11,2.11,2.43,2.43,2.50,2.50,2.59,2.59,2.66,2.66,2.74,2.74
1,2022-01-05,光大银行,1.77,1.77,2.17,2.17,1.80,1.80,2.43,2.43,2.50,2.50,2.59,2.59,2.66,2.66,2.74,2.74
2,2022-01-06,汇丰中国,1.71,1.71,2.01,2.01,1.95,1.95,2.43,2.43,2.50,2.50,2.59,2.59,2.66,2.66,2.74,2.74
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
231,2021-12-29,交通银行,1.35,1.35,2.40,2.40,3.15,3.15,2.43,2.43,2.51,2.51,2.60,2.60,2.67,2.67,2.74,2.74
232,2021-12-30,光大银行,1.26,1.26,2.37,2.37,3.11,3.11,2.43,2.43,2.50,2.50,2.59,2.59,2.66,2.66,2.74,2.74
233,2021-12-31,汇丰中国,2.12,2.12,2.26,2.26,2.98,2.98,2.43,2.43,2.50,2.50,2.59,2.59,2.66,2.66,2.74,2.74

### 2.1 SHIBOR Rates Data

In [6]:
dai.query("""
SELECT *
FROM cn_shibor_lpr_TS_raw
WHERE date >= '2015-12-31'
""").df()

         date  in_1y  in_5y
0  2024-01-22   3.45   4.20
1  2024-02-20   3.45   3.95
2  2024-03-20   3.45   3.95
..        ...    ...    ...
5  2024-06-20   3.45   3.95
6  2024-09-20   3.35   3.85
7  2024-10-21   3.10   3.60

[8 rows x 3 columns]